[
{
"name": "Absol",
"move":["Super Luck", "Basic Attack", "Feint", "Night Slash", "Pursuit", "Slash", "Psycho Cut", "Sucker Punch", "Midnight Slash"],
"movecd":["Null", "Null", "8", "5", "5", "6", "7", "6", "134"],
"movedesc":["Increases Critical-Hit rate by 15%.", "Becomes a boosted attack with every third attack, dealing damage to enemies and lowering their Defense by 15% for 2s when it hits. If this boosted attack hits only a single target, it deals increased damage.", "Absol dashes in an arc, damaging all enemies hit. Absol deals damage as if enemies hit have 0 defense and bypasses shields.", "Absol dashes in an arc, damaging and slowing the first Pokémon hit. If Absol hits, this ability can be activated within 6s – allowing Absol to dash again, dealing damage to all enemies hit. The second hit also has increased critical-rate based on enemy remaining HP (the lower their HP, the higher the critical-rate). Cooldown on Hit or without recasting is 6s.", "Absol dashes to a location, and dashes to an enemy with its next basic attack. If Absol hits the back of the target, this ability's cooldown is reduced. If it fails to hit the back, damage is halved.", "Absol quickly slashes in front of themself, damaging any enemy hit by the slash. Slash has an increased cricital-hit rate.", "Absol throws a wide slash in front, damaging, debuffing, and slowing enemies hit for 5s. This debuff applies extra damage the next 3 times Absol hits the debuffed Pokémon with an auto attack or a Psycho Cut.", "Absol attacks a target Pokémon, slowing both the target and Absol. If Absol is attacked while channeling the dash, Absol takes no damage from the attack, immediately dashes to the target, and this hit does 1.5x damage and stuns the target.", "Absol heals on hit, and if the damage is a critical hit, the Heal doubles.", "Absol gains movement speed upgrade after the initial dash.", "Increases Absol's movespeed when near a debuffed enemy.", "Increases base attack speed after a successful counter."],
"moversb": ["Null","Damage - Basic: 100% Atk ; Damage - Boosted: 51% Atk + 5 x (Level - 1) + 100 ; Damage - Single Target Bonus: 37.5% Atk + 1 x (Level - 1) + 20", "Damage: 66% Atk + 7 x (Level - 1) + 130", "Damage - First Hit: 78% Atk + 4 x (Level - 1) + 180 ; Damage - Second Hit 117% Atk + 5 x (Level - 1) + 270", "Damage - From The Back : 198% Atk + 19 x (Level - 1) + 396", "Damage: 89% Atk + 6 x (Level - 1) + 200", "Damage: 30.5% Atk + 3 x (Level - 1) + 60", "Damage: 105% Atk + 6 x (Level - 1) + 165", "Damage - First 6 Hits: 91% Atk + 4 x (Level - 1) + 200 ; Damage - Final 3 Hits: 28% Atk + 1 x (Level - 1) + 59"],
"moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Super%20Luck.png","https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png","https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Feint.png","https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Night%20Slash.png","https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Pursuit.png","https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Slash.png","https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Psycho%20Cut.png","https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Sucker%20Punch.png","https://d275t8dp8rxb42.cloudfront.net/skills/Absol/Midnight%20Slash.png","https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Absol.png"],
"class":["Speedster", 7, 4, 8, 5, 1]
},

{"name": "Blastoise",
    "move":["Torrent", "Basic Attack", "Water Gun", "Hydro Pump", "Water Spout", "Skull Bash", "Surf", "Rapid Spin", "Hydro Typhoon"],
    "movecd":["Null", "Null", "9", "8.5", "7.5", "10", "12", "11", "112"],
    "movedesc":["Increases Attack and Sp. Attack by 20% while at half HP or less.","Becomes a boosted attack with every third attack, dealing 3 instances of damage, slowing enemies hit, and reducing Blastoise’s move cooldowns by 1 second each. When evolving into Blastoise, basic attacks instead strike twice for 50% Atk.","Blastoise shoots a jet of water in a straight line, damaging, stunning, and knocking back enemies hit. Enemies hit are also slowed for 1 second.","Blastoise shoots a large amount of water: damaging, stunning, and knocking back enemies hit. During Rapid Spin: Blastoise unleashes a large burst of water in a radius around themselves, damaging, stunning, and knocking back enemies hit. Blastoise also gains a small movement speed bonus for the duration of this move.","Blastoise calls down a barrage of water in a targeted radius. Enemies within the radius are struck 6 times over its duration, damaging and slowing them. During Rapid Spin: Blastoise rapidly unleashes bursts of water in a radius around themselves dealing up to 8 instances of damage over a short duration. Blastoise also gains a small movement speed bonus for the duration of this move.","Blastoise dashes forward damaging and stunning all enemies hit.","Blastoise rides a large wave in the designated direction, damaging, stunning, and knocking back enemies hit. Blastoise is unstoppable while surfing, and once it ends, Blastoise can jump in a designated direction. The wave continues for a short duration after Blastoise has leapt off and continues to knock back enemies hit but inflicts no damage.","Blastoise withdraws into its shell and begins rapidly spinning, resetting the cooldown of its other move. Blastoise is unstoppable for the duration of Rapid Spin and can freely move about the battlefield. While spinning, Blastoise will damage and slow nearby enemies. Blastoise’s next basic attack after Rapid Spin ends becomes boosted. For the duration of Rapid Spin, the mechanics of Blastoise’s Basic attacks as well as Hydro Pump and Water Spout are changed.","Blastoise gains a shield and sweeps powerful water jets in a large circle around itself dealing massive damage and knocking enemies hit into the air.","Hydro Pump deals increased damage.","Water Spout deals increased damage.","Blastoise gains a small shield when hitting an enemy with Surf.","Blastoise gains a massive amount of Def and SpDef for the duration of Rapid Spin."],
    "moversb":["Null","Damage - Basic: 100% Atk ; Damage - Boosted (3x): 20% SpA + 5 x (Level - 1) + 90","Damage: 88% SpA + 16 x (Level - 1) + 510","Damage (3 Hits): 47.5% SpA + 8 x (Level - 1) + 310 ; Damade - During Rapid Spin : 95% SpA + 16 x (Level - 1) + 620 "," Damage - Area (6 Hits): 36% SpA + 4 x (Level - 1) + 120 ;Damage - Area (8 Hits) During Rapid Spin: 36% SpA + 4 x (Level - 1) + 120 ","Damage: 54% SpA + 10 x (Level - 1) + 310","Damage: 125% SpA + 18 x (Level - 1) + 800","Damage (10 hits): 21% SpA + 3 x (Level - 1) + 140","Damage: 218% SpA + 27 x (Level - 1) + 1390","Damage (3 Hits): 57% SpA + 9 x (Level - 1) + 370 ; Damage - During Rapid Spin: 114% SpA + 18 x (Level - 1) + 740","Damage - Area (6 Hits): 42% SpA + 4 x (Level - 1) + 140 ; Damage - Area (8 Hits) During Rapid Spin: 42% SpA + 4 x (Level - 1) + 140","Null","Defense & Sp. Defense: 0% SpA + 10 x (Level - 1) + 300"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Torrent.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Water%20Gun.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Hydro%20Pump.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Water%20Spout.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Skull%20Bash.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Surf.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Rapid%20Spin.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Blastoise/Hydro%20Typhoon.png",
    "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Blastoise.png"],
    "class":["Defender", "4 ","7 ","4 ","4 ","6 "]
    }, 
{"name": "Greedent", "move":["Cheek Pouch", "Basic Attack", "Tackle", "Bullet Seed", "Belch", "Defense Curl", "Stuff Cheeks", "Covet", "Berry Belly Flop"], "movecd":["Null", "Null", "6", "5", "5", "8", "8", "9", "140"], "movedesc":["When Greedent eats a berry, recover HP after receiving the effects of the berry. At the same time, Greedent stashes an Oran berry in its tail. Being hit by a single attack or combination of attacks will cause an Oran berry to drop from Greedent's tail. Berries stay on the ground for 10s. If any ally or enemy eats an Oran Berry, they heal for 60 + 2% max HP (unless the enemy is Greedent). Greedent enemies that eat an Oran Berry heal for 60 + 6 x (Level -1) + 2% max HP","Becomes a boosted attack with every third attack, dealing increased damage when it hits and causing one berry to drop from Greedent's tail.","Leap to the designated area, dealing damage to enemies in the area of effect and decrease their movement speed for a short time. If this move is used while Covet is active, no area can be designated for the user to leap to. Instead, while the user is running, damage is dealt in an area to enemies in front of Greedent. If Greedent has any Oran berries stashed, consume all of them, reducing Tackle's cooldown for each berry consumed.","Spit berry seeds in the designated direction, dealing damage to enemies in the area of effect and decrease their movement speed for a short time. The more Oran berries Greedent has stashed, the more damage this move deals.","Deals damage to enemies in the area of effect and decrease their movement speed for a short time. If Greedent has any Oran berries stashed, consume all of them, reducing Belch's cooldown for each berry consumed.","Grants Greedent a shield (15% max HP) for a short time. In addition, an Oran berry will drop in front of Greedent.","Greedent drops several Oran berries, which can be eaten to recover HP. Any HP recovered from an Oran berry eaten within 5s that exceeds Greedent's max HP will be converted to a shield. If Greedent catches sight of a berry while using this move, movement speed is increased for a short time.","Greedent runs with all its might, becoming unstoppable and dealing damage to enemies hit and throwing them. While running, Greedent drops Oran berries. Eating a dropped berry increases movement speed for a short time. The more berries eaten, the more movement speed is increased. In addition, Tackle, Belch or Bullet Seed can also be used while running and using this move will reset the cooldown of Tackle or Belch. This damage is mitigated by Defense.","Greedent eats an Oran berry to recover HP and then leaps to the designated area, dealing damage and throwing enemies within the area of effect. Greedent then eats a special berry, allowing an unlimited amount of Oran berries to be stored for a short time and resets cooldowns of all moves.","Increased damage.","Increased damage.","Increase the number of Oran berries dropped.","Increased damage dealt and increased frequency of Oran berries dropping."], "moversb":["Healing - Oran Berry: 60 + 6 x (Level - 1) + 2% max HP Healing - Any Berry: 30 + 3 (Level - 1) + 1% Max HP ","Damage - Basic: 100% Atk Damage - Boosted: 75% Atk + 4 x (Level - 1) + 80","Damage: 101% Atk + 16 x (Level - 1) + 310","Damage: 18% Atk + 3 x (Level - 1) + 55","Damage: 220% Atk + 35 x (Level - 1) + 850","Null","Null","Damage: 75% SpA + 5 x (Level - 1) + 250","Damage: 241% Atk + 22 x (Level - 1) + 1050","Damage: 20% Atk + 3 x (Level - 1) + 60","Damage: 233% Atk + 38 x (Level - 1) + 890","Null","Damage: 79% SpA + 6 x (Level - 1) + 280"], "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Cheek%20Pouch.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Tackle.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Bullet%20Seed.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Belch.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Defense%20Curl.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Stuff%20Cheeks.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Covet.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greedent/Berry%20Belly%20Flop.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Greedent.png"], "class":["Defender", "3","10","4","2","7"] },

    {"name": "Greninja",
        "move":["Torrent", "Attack", "Bubble", "Water Shuriken", "Surf", "Substitute", "Double Team", "Smokescreen", "Waterburst Shuriken"],
        "movecd":["Null", "Null", "9s", "5s", "9s", "8s", "9s", "13s", "164s"],
        "movedesc":["While HP is at 50% or less, Attack is increased by 5% and movement speed is increased by 12%.","At range, Greninja's basic attacks reduce the cooldown of Surf, Water Shuriken, or Bubble by 0.5 seconds and boosted attacks apply a slow. In melee, Greninja's basic attacks instead deal bonus damage equal to 5% missing HP (calculated as basic attack damage and subject to basic attack effects). Boosted melee attacks also dash through the primary target and increases the missing HP damage to 10%.","Greninja launches 2 bubbles which pop when they hit an enemy, damaging and slowing them.","Greninja throws 3-5 shurikens made of water which explode when they hit an enemy, damaging and slowing enemies in a small area while healing Greninja.","Greninja dashes on a wave, damaging enemies and healing themself for each enemy hit. Enemies below half health are dealt bonus damage, and if this move KOs an enemy the cooldown is reset.","Greninja dashes while leaving behind a targetable decoy. Greninja is unstoppable while dashing."," Greninja briefly vanishes before dashing and sending clones in different directions. The clones can attack nearby targets. Greninja is unstoppable while dashing.","Greninja becomes invisible, leaving behind a cloud of smoke while dashing and gaining bonus movement speed. Greninja's next attack is boosted and deals 5% increased damage. Greninja is unstoppable while dashing.","Throw a giant water shuriken toward the designated area, dealing damage to enemies in the area of effect and decreasing their movement speed for a short time when this move hits. The water shuriken then immediately explodes, dealing damage to enemies in the area of effect and throws them in the air. Once this move ends, Greninja may jump in a designated direction.","Throws 4-6 shurikens instead.","Increases healing.","Reduces cooldown.","Also increases Greninja's attack by 20% for 3s when leaving stealth."],
        "moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 120% Atk + 0 x (Level - 1) + 0","Damage - per Hit (2 Hits): 103% Atk + 6 x (Level - 1) + 190","Damage (per Shuriken): 122% Atk + 8 x (Level - 1) + 190 ; Healing (per Unique Enemy): 20.8% Atk + 2 x (Level - 1) + 34","Damage: 226% Atk + 9 x (Level - 1) + 410 ; Damage - Bonus: 113% Atk + 5 x (Level - 1) + 205 ; Healing: 45.2% Atk + 5 x (Level - 1) + 82","Null","Null","Null", "Damage (2x): 284% Atk + 11 x (Level - 1) + 520","Null","Healing: 54.24% Atk + 6 x (Level - 1) + 150","Null","Null"],
        "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Torrent.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Bubble.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Water%20Shuriken.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Surf.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Substitute.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Double%20Team.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Smokescreen.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Greninja/Waterburst%20Shuriken.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Greninja.png"],
        "class":["Attacker", "8","4","6","6","1"]
        },

    {"name": "Lucario",
        "move":["Steadfast", "Basic Attack", "Quick Attack", "Extreme Speed", "Power-up Punch", "Meteor Mash", "Bone Rush ", "Close Combat", "Aura Cannon"],
        "movecd":["60s", "Null", "6s", "9s", "7s", "7s", "10s", "9s", "134s"],
        "movedesc":["When dropping below 50% HP, gain a shield and increased movement speed for 5s (60s cooldown).","Becomes a boosted attack with every third attack, striking twice. The first attack is a normal basic attack and the second is an additional attack that can critically hit, has increased attack range, and throws enemies into the air.","Lucario dashes forward, damaging all enemies hit.","Lucario dashes forward, damaging all enemies hit and healing Lucario for each enemy hit. The first enemy hit will reset the cooldown of Extreme Speed. This effect cannot occur on the same target more than once every 10 seconds. Attacking immediately after the dash will perform a unique attack in an area dealing 75% Atk and can critically hit.","Lucario begins charging power, slowing themself and reducing damage taken while preparing to unleash a devastating punch. Upon release, Lucario lunges – damaging the first enemy hit. Power-Up Punch does bonus damage based on the enemy's missing health, and will cause Lucario's next attack to be boosted. The cooldown for Power-Up Punch is reduced whenever Lucario lands a move.","Lucario punches with the force of a meteor, damaging and knocking enemies back.","Lucario rapidly strikes with a bone, damaging enemies hit 6 times. Lucario then throws the bone after the final strike, shoving enemies and causing the bone to land a short distance away. Lucario can activate Bone Rush again to teleport to the bone, damaging enemies in a small area around it. Landing one of Bone Rush's initial strikes will reset the cooldown timer for extreme speed on that target.","Lucario rapidly punches, damaging enemies in the area in front of them 11 times over the duration.","Aura Cannon does not have a limit to the number of times it can hit one target, rather it deals damage to enemies in its area while it travels, gaining speed. At close range, a still enemy can be hit up to 4 times and when the cannon is at max speed, a still enemy will only be struck twice. Damage of the next Power-Up Punch is increased by roughly 20%, and enemies hit by the cannon have their internal cooldown for Extreme Speed reset.","Increases Lucario's Attack by 15% for a short period of time after use.","Lucario is unstoppable while charging the punch.","Teleporting to the bone will reset the cooldown of Extreme Speed or Power-Up Punch.","Damage is increased."],
        "moversb":["Shield: 250% Atk + 50 x (Level - 1) + 400","Damage - Basic: 100% Atk ; Damage - Boosted (2nd Hit): 30% Atk + 0 x (Level - 1) + 0","Damage: 221% Atk + 11 x (Level - 1) + 240","Damage: 225% Atk + 6 x (Level - 1) + 280 ; Healing: 45% Atk + 1 x (Level - 1) + 56","Damage - Uncharged: 247.59% Atk + 5 x (Level - 1) + 103 ; Damage - Fully Charged: 451.95% Atk + 5 x (Level - 1) + 189 ; Damage - Execute:10% of Enemy Missing HP.","Damage: 200% Atk + 10 x (Level - 1) + 210","Damage - per Hit (7 Hits): 41% Atk + 1 x (Level - 1) + 50","Damage - per Hit (11 Hits): 59% Atk + 2 x (Level - 1) + 76","Damage - per Tick: 174% Atk + 4 x (Level - 1) + 210","Null","Null","Null","Damage - per Hit (11 Hits): 62% Atk + 2 x (Level - 1) + 80"],
        "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Steadfast.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Quick%20Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Extreme%20Speed.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Power-Up%20Punch.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Meteor%20Mash.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Bone%20Rush.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Close%20Combat.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Lucario/Aura%20Cannon.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Lucario.png"],
        "class":["All Rounder", "6","5","7","6","1"]
        }, 

{"name": "Machamp",
    "move":["Guts", "Basic Attack", "Karate Chop", "Close Combat", "Cross Chop", "Bulk Up", "Dynamic Punch", "Submission", "Barrage Blow"],
    "movecd":["Null", "Null", "6", "6", "6", "9", "8", "11", "134"],
    "movedesc":["Increases Attack by 10% for 5s when afflicted by a status condition.","Becomes a boosted attack with every third attack, dealing increased damage when it hits. This boosted attack also decreases the movement speed of enemies for a short time.","Machamp attacks in a straight line dealing damage to enemies hit.","Machamp unleashes a barrage of blows in a targeted direction, hitting multiple times and finishing with a single large strike. Machamp is unstoppable for the duration and can move while using close combat.","Machamp dashes forward dealing damage to enemies hit. Cross chop has an increased critical hit rate and can critically strike.","Machamp buffs themselves for 3 seconds increasing attack by 15%. Machamp is unstoppable for the duration and gains a small amount of attack speed and movement speed. Machamp’s next basic attack is boosted.","Machamp jumps to target location, briefly stunning enemies hit, slowing them, and dealing damage four times in quick succession to the landing radius. Machamp’s Atk is increased by 15% and gains bonus movement speed for 6 seconds when using Dynamic Punch.","Machamp becomes unstoppable and gains significant movement speed for 5 seconds or until the next basic attack. Machamp’s next basic attack during submission is enhanced hitting twice and slamming the target down behind Machamp. If this attack hits Machamp also gains increased critical hit rate and attack speed for 3 seconds.","Increases Machamp's movement speed, Attack by 30%, Defense by 200, and Sp. Defense by 200 for a short time. If used again, unleash a combo attack, dealing damage to enemies in the area of effect and shoving them. The final blow deals double the damage of the previous hits.","Deals additional damage if the target is affected by a status condition.","Machamp’s basic attacks increases Atk by 2 and stacking up to 40 times.","Further increases Atk (from 15% to 20%) and movement speed.","Further increases critical hit rate and attack speed bonuses."],
    "moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 150% Atk + 0 x (Level - 1) + 0", "Damage: 205% Atk + 15 x (Level - 1) + 270", "Damage - per Hit (4 hits): 59% Atk + 2 x (Level - 1) + 50 ; Damage - Final Hit: 177% Atk + 6 x (Level - 1) + 150", "Damage: 98% Atk + 13 x (Level - 1) + 290", "Null", "Damage per Tick (4 Ticks): 37% Atk + 2 x (Level - 1) + 70", "Damage (2x): 91% Atk + 4 x (Level - 1) + 170", "Damage (6x): 100% Atk + 2 x (Level - 1) + 100","Null", "Null", "Null", "Null"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Guts.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Karate%20Chop.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Close%20Combat.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Cross%20Chop.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Bulk%20Up.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Dynamic%20Punch.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Submission.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Machamp/Barrage%20Blow.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Machamp.png"],
    "class":["Attacker", "8","5","5","5","2"]
    },

{"name": "Mamoswine",
    "move":["Thick Fat", "Basic Attack", "Ice Shard", "Icicle Crash", "Ice Fang", "Tackle", "High Horsepower", "Earthquake", "Mammoth Mash"],
    "movecd":["Null", "Null", "7", "10", "8", "8", "8", "7.5", "134"],
    "movedesc":["When Mamoswine deals damage, Defense and Sp. Def are increased for 3s, stacking up to 3 times. When Mamoswine uses Ice Shard, Icicle Crash or Ice Fang, the next basic attack is boosted. If any of these moves creates a freezing area of effect inside an ally goal zone, the goal-scoring speed of enemies is decreased.","Becomes a boosted attack with every third attack, dealing damage and freezing enemies for a short time when it hits. Mamoswine's basic attacks deal increased damage for a short time to enemies recently frozen with one of Mamoswine's moves.","Hurls 3 chunks of ice at the designated location, dealing damage to enemies in the area of effect and decreasing their movement speed for a short time. If an enemy is hit by all three chunks, they're left frozen for a short time.","Drops icicles on the designated location, dealing damage to enemies in the area of effect and decreasing their movement speed for a short time. The final icicle shatters after a set amount of time or when hit by Mamoswine's other moves or boosted attacks, dealing damage to enemies in the area of effect and leaving them frozen. If the icicle is shattered by Tackle or High Horsepower, the ground is covered in ice, which increases the movement speed of allies that run over it. The next basic attack is boosted.","Uses cold-infused fangs to throw the opposing Pokémon closest to the user, dealing damage and leaving them frozen for a short time. The user can then designate a direction to slam the thrown Pokémon forward or backward, dealing damage to enemies in the area of effect and leaving them frozen for a short time. The next basic attack is boosted.","Mamoswine rushes recklessly in the designated direction, dealing damage to enemies they hit and throws them in the air."," Mamoswine rushes recklessly in the designated direction, dealing damage to enemies they hit and shove them. Mamoswine then stomps their feet, dealing damage to enemies in the area of effect and leaves them unable to act for a short time. This stomping deals increased damage to frozen enemies.","Mamoswine leaps up in the designated direction and lands forcefully, dealing damage to enemies in the area of effect and pulling them toward Mamoswine.","Mamoswine jumps to the designated location and becomes immune to hindrances - then repeatedly stomps the ground, dealing damage to enemies in the area of effect and decreases their movement speed for a short time with each stomp. The final stomp throws enemies in the air.","The final icicle leaves enemies hit unable to act for a short time.","Increases the area of effect in which enemies are left frozen after the slam attack.","Increases the reckless rush's speed and the length of time enemies are left unable to act.","Decreases the movement speed of enemies for a short time when this move hits and increases the move's pulling power."],
    "moversb":["Defense & Sp. Defense: 0% Atk + 6 x (Level - 1) + 20", "Damage - Basic: 100% Atk ; Damage - Boosted: 57% Atk + 8 x (Level - 1) + 150 ; Damage - Frozen Bonus: 19% Atk + 3 x (Level - 1) + 50", "Damage - per Shard (3 shards): 62% Atk + 4 x (Level - 1) + 140", "Damage - Small Icicles (3x): 40% Atk + 3 x (Level - 1) + 120 ; Damage - Large Icicle: 60% Atk + 5 x (Level - 1) + 180 ; Damage - Shatter: 80% Atk + 6 x (Level - 1) + 240", "Damage - First Hit: 60% Atk + 4 x (Level - 1) + 170 ; Damage - Second Hit: 180% Atk + 12 x (Level - 1) + 510", "Damage: 101% Atk + 7 x (Level - 1) + 230", "Damage - Charge: 61% Atk + 4 x (Level - 1) + 170 ; Damage - Stomp: 122% Atk + 8 x (Level - 1) + 340 ; Damage - Frozen Stomp Bonus: 91.5% Atk + 6 x (Level - 1) + 255", "Damage: 151% Atk + 10 x (Level - 1) + 420", "Damage - First Stomp: 153% Atk + 9 x (Level - 1) + 420 ; Damage - Mini Stomps (2 stomps): 102% Atk + 6 x (Level - 1) + 280 ; Damage - Final Stomp: 204% Atk + 12 x (Level - 1) + 560"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/Thick%20Fat.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/Ice%20Shard.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/Icicle%20Crash.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/Ice%20Fang.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/Tackle.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/High%20Horsepower.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/Earthquake.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mamoswine/Mammoth%20Mash.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Mamoswine.png"],
    "class":["Defender", "5","8","4","3","5"]
    },

{"name": "Mr. Mime",
    "move":["Filter", "Basic Attack", "Fake Out", "Confusion", "Psychic", "Light Screen", "Barrier", "Guard Swap", "Showtime"],
    "movecd":["Null", "Null", "7", "6", "6", "8", "8", "4.5", "100"],
    "movedesc":["Upon casting an ability, Mr. Mime takes 10% less damage for 2 seconds.","Becomes a boosted attack with every third attack, dealing increased damage and throwing enemies when it hits.","Mr. Mime claps, damaging and knocking enemies back in a cone.","Mr. Mime fires a wave of psychic energy, damaging and knocking enemies back. Enemies hit into a wall take bonus damage and are stunned. Enemies debuffed by Guard Swap take bonus damage and are stunned, but are not knocked back.","After a short channel, Mr. Mime creates a pulse of energy that damages enemies around themself and any target affected by Guard Swap, with a smaller pulse around any created Barriers or Light Screens. Enemies hit by more than 1 pulse are stunned.","Mr. Mime creates a wall that prevents enemies from passing.","Mr. Mime creates a wall that prevents enemies from passing. Holds 2 uses in reserve and cannot be used more than once every 2s. When upgrading Barrier, reserved Barriers will be restored to the maximum.","Mr. Mime fires a beam, swapping Defense and Sp. Defense with another PokÃ©mon for a short time when it hits. Swapping with an enemy slows and damages them over time while increasing Mr. Mime's movement speed. Swapping with an ally increases the movement speed of that ally and Mr. Mime.","Mr. Mime leaps forward and begins a performance, stunning enemies and dealing damage in a large area around him 4 times. The final hit does double damage.","Increased damage.","Also briefly slows.","Stores 3 charges in reserve instead.","Heals Mr. Mime, plus an ally if tethered to them."],
    "moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 50% SpA + 16 x (Level - 1) + 290", "Damage: 194% SpA + 25 x (Level - 1) + 470", "Damage: 170.4% SpA + 20 x (Level - 1) + 460 ; Damage - Wall Hit: 204.48% SpA + 23 x (Level - 1) + 552 ; Damage: 213% SpA + 23 x (Level - 1) + 510 ; Damage - Wall Hit: 255.6% SpA + 27 x (Level - 1) + 612", "Damage: 152% SpA + 16 x (Level - 1) + 370", "Null", "Null", "Damage: 19% SpA + 2 x (Level - 1) + 50 ; Healing: 12% SpA + 2 x (Level - 1) + 60", "Damage - First 3 Hits: 88% SpA + 5 x (Level - 1) + 240 ; Damage - Final Hit: 176% SpA + 10 x (Level - 1) + 480","Null", "Null", "Null", "Null"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Mr.Mime/Filter.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mr.+Mime/Fake%20Out.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mr.+Mime/Confusion.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mr.+Mime/Psychic.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mr.+Mime/Light%20Screen.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mr.+Mime/Barrier.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mr.+Mime/Guard%20Swap.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Mr.Mime/Showtime.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Mr.Mime.png"],
    "class":["Support", "3","8","2","3","8"]
    },

{"name": "Ninetales",
    "move":["Snow Warning", "Basic Attack", "Powder Snow", "Avalanche", "Dazzling Gleam", "Icy Wind", "Blizzard", "Aurora Veil", "Snow Globe"],
    "movecd":["Null", "Null", "5", "7", "7.5", "8", "11", "13", "134"],
    "movedesc":["Causes snow to fall on an enemy, dealing damage to it and decreasing their movement speed for a short time. Boosted attacks and moves (except Aurora Veil) sling snow, and hitting the same target with snow multiple times will freeze it for a short time.","Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to nearby enemies and decreases their movement speed for a short time.","Ninetales attacks with a chilly gust of powdery snow, slowing and damaging enemies hit.","Ninetales attacks with a gust of chilly ice toward in designated direction. The ice damages enemies and forms a wall that can't be walked through. After a short time this wall melts and collapses, further damaging enemies in a radius around the wall.","Ninetales attacks with a powerful cone of blinding light, stunning and damaging enemies hit.","Ninetales attacks with a gust of freezing air, damaging and slowing enemies hit.","Ninetales summons a howling blizzard in 2 blasts in front of them (second hit double first hit damage). If the second blast hits a wall, create an area at the impact dealing 6 ticks of damage (damage per tick same as first hit).","Ninetales creates an aurora around them, reducing damage received by them and nearby allies by 30% in the aurora radius. While Ninetales is inside the aurora, movement speed is increased by 20% and all basic attacks are boosted.","Attack with a chilly blast of snow and ice, dealing damage to enemies in the area of effect around Ninetales when it hits. Deals increased damage to enemies that are frozen.","Also decreases the movement speed of enemies for a short time when this move hits."," Increased damage dealt and stun duration.","Increased damage.","Damage reduced by 35%."],
    "moversb":["Damage: 60% SpA + 0 x (Level - 1) + 100", "Damage - Basic: 100% Atk ; Damage - Boosted: 56% SpA + 14 x (Level - 1) + 260", "Damage: 78% SpA + 13 x (Level - 1) + 240", "Damage - Wind or Wall: 36% SpA + 8 x (Level - 1) + 190", "Damage: 60% SpA + 10 x (Level - 1) + 320 ; Damage: 61% SpA + 10 x (Level - 1) + 380", "Damage - Initial Blast: 22.5% SpA + 3 x (Level - 1) + 150 ; Damage - Area (6 Ticks): 22.5% SpA + 3 x (Level - 1) + 150 ; Damage - Initial Blast: 25% SpA + 4 x (Level - 1) + 170 ; Damage - Area (6 Ticks): 25% SpA + 4 x (Level - 1) + 170", "Null", "Damage - Frozen Enemies: 224% SpA + 32 x (Level - 1) + 1520 ; Damage - Unfrozen Enemies: 156.79% SpA + 30 x (Level - 1) + 1064","Null", "Null", "Null", "Null"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Snow%20Warning.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Powder%20Snow.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Avalanche.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Dazzling%20Gleam.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Icy%20Wind.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Blizzard.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Aurora%20Veil.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Ninetales/Snow%20Globe.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Ninetales.png"],
    "class":["Attacker", "8","3","3","5","6"]
    },

{"name": "Pikachu",
    "move":["Static", "Basic Attack", "Thunder Shock", "Electro Ball", "Thunder", "Electro Web", "Volt Tackle", "Thunderbolt", "Thunderstorm"],
    "movecd":["30", "Null", "5", "5", "8", "9", "10", "8", "139"],
    "movedesc":["Paralyzes (slow) all enemies nearby for a short time when receiving damage. This ability goes on a 30s cooldown after it's triggered.","Becomes a boosted attack with every third attack, dealing increased damage. This boosted attack also paralyzes enemies for a short time when it hits.","Pikachu releases electricity to a designated area, damaging enemies in the radius. Also paralyzes (slows) enemies for a short time.","Pikachu hurls an electric orb at an enemy, paralyzing (slowing) and damaging them and nearby enemies. Damage increases as the enemies' remaining HP decreases.","Pikachu drops wicked thunderbolts at a designated area, damaging enemies in the radius.","Pikachu attacks and captures enemies using an electric net, rooting them.","Pikachu electrifies themself and charges ahead becoming unstoppable, throwing and damaging enemies hit.","Pikachu attacks with a strong electric blast at a designated area, stunning and damaging enemies in the area.","Four bolts of lightning strike 4 times over 3 seconds. The first strike hits all enemies in the radius, and the next three strikes hit a random enemy within radius.","Increased damage.","Increases the number of times this move attacks.","Reduced cooldown.","Increased damage."],
    "moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 38% SpA + 10 x (Level - 1) + 200", "Damage: 70% SpA + 20 x (Level - 1) + 360", "Damage - Area: 66% SpA + 25 x (Level - 1) + 530 ; Damage - Area: 77% SpA + 29 x (Level - 1) + 640 ; Damage - Execute: 5% of enemy missing HP.", "Damage - Area (5x): 20% SpA + 5 x (Level - 1) + 210", "Damage: 36% SpA + 11 x (Level - 1) + 350", "Damage (5x): 13% SpA + 3 x (Level - 1) + 130", "Damage: 50% SpA + 12 x (Level - 1) + 500 ; Damage: 61% SpA + 12 x (Level - 1) + 609", "Damage: 49% SpA + 10 x (Level - 1) + 490","Null", "Null", "Null", "Null"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Static.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Thunder%20Shock.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Electro%20Ball.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Thunder.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Electro%20Web.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Volt%20Tackle.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Thunderbolt.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Pikachu/Thunderstorm.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Pikachu.png"],
    "class":["Attacker", "9","3","5","4","3"]
    },


{"name": "Slowbro",
    "move":["Oblivious", "Basic Attack", "Water Gun", "Scald", "Surf", "Slack Off", "Amnesia", "Telekinesis", "Slowbeam"],
    "movecd":["Null", "Null", "5", "5", "9", "11", "9", "11", "134"],
    "movedesc":["Damage taken is converted to blue HP, which goes away after a few seconds. When hitting an enemy, some of Slowbro's blue HP is restored and the target loses 4% Sp. Def, stacking up to 20%. When using a move that buffs or heals Slowbro, restore some of Slowbro's blue HP.","Becomes a boosted attack with every third attack. When this boosted attack hits, deal damage to nearby enemies and decrease their movement speed.","Slowbro fires a stream of water, damaging and slowing enemies hit. This move can be channeled to increase its range and damage.","Slowbro fires a stream of boiling water, damaging enemies hit; creating a cloud of stream at the location of the first enemy hit, which slows and applies burn to all enemies inside. This burn reduces Attack by 30%.","Slowbro rides on a wave, damaging, knocking enemies back, and throwing them in the air briefly. Two more waves follow after the first, damaging and slowing enemies.","Slowbro takes a nap, healing over the duration. Taking damage during the channel will reduce the amount healed.","Slowbro briefly becomes unstoppable, gaining +300 Defense for 4s, healing 22.5% of Slowbro's Oblivious health (blue HP) 3 times, and gains 10% bonus damage on the next Surf or Scald used."," Slowbro shoots a beam, causing the first enemy hit to float in the air restoring 15% of Slowbro's Oblivious health (blue HP). Slowbro can reactivate the ability to pull the enemy to them, but otherwise cannot act for the duration.","Increases the size of the steam cloud.","The second and third waves will now also throw enemies in the air, and the second wave will knock them back.","Also increases Slowbro's Sp. Attack by 15%.","Increases the range and speed of the beam."],
    "moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 110% SpA + 9 x (Level - 1) + 180", "Damage - Uncharged: 132% SpA + 11 x (Level - 1) + 210 ; Damage - Low Charge: 176% SpA + 15 x (Level - 1) + 280 ; Damage - Mid Charge: 220% SpA + 19 x (Level - 1) + 350 ; Damage - High Charge: 264% SpA + 23 x (Level - 1) + 420", "Damage - per Hit (3 Hits): 72% SpA + 6 x (Level - 1) + 135 ; Damage - Burn (5 Ticks): 14.4% SpA + 1 x (Level - 1) + 27", "Damage - per Wave (3 Waves): 103% SpA + 6 x (Level - 1) + 210", "Null", "Null", "Damage (x6): 80% SpA + 3 x (Level - 1) + 170","Null", "Null", "Null", "Null"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Oblivious.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Water%20Gun.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Scald.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Surf.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Slack%20Off.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Amnesia.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Telekinesis.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Slowbro/Slowbeam.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Slowbro.png"],
    "class":["Defender", "3","8","3","3","8"]
    },

{"name": "Snorlax",
    "move":["Gluttony", "Basic Attack", "Tackle", "Heavy Slam", "Flail", "Rest", "Block", "Yawn", "Power Nap"],
    "movecd":["Null", "Null", "6", "7", "6.5", "10", "11", "12", "128"],
    "movedesc":["Increases the effects gained from eating berries. 25% increased movement speed when near berries and doubles the amount healed from the Sitrus berry (yellow berry).","Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to nearby enemies and decreases their movement speed for a short time.","Snorlax dashes a short distance forward, dealing damage and stunning the first target hit. Snorlax’s next basic attack is boosted.","Snorlax jumps to target location, dealing damage and throwing enemies within the landing radius into the air briefly.","Snorlax buffs themselves for 4 seconds causing basic attacks to deal increased damage. Damage increase is strengthened for every 20% HP Snorlax is missing. Snorlax also gains a short burst of increased movement speed when Flail is activated.","Snorlax falls asleep for a short duration, healing 3 times for 8% Max HP. While asleep other Pokémon cannot pass through Snorlax’s hitbox.","Snorlax creates and holds a wall in a targeted direction for 4 seconds and gains a shield. The shield lasts 3.75 sec even if Block is cancelled early. Enemies that contact the wall are knocked back and stunned. Snorlax cannot attack or use abilities while Blocking but can move slowly. While Blocking Snorlax’s Def and SpDef are increased by 25%.","Snorlax sends out a slow short-range projectile that puts all targets hit to Sleep for 2 seconds","Go to sleep and begin snoring, dealing damage to enemies in the area of effect and throws them in the air. While sleeping, become immune to hindrances, deal damage over time to nearby enemies, and continually restore 7% of max HP, 9 times."," Deals increased damage.","Deals increased damage and causes Snorlax’s basic attacks to also heal them while they are below 40% MaxHP.","No Difference.","Targets are also slowed for 3s upon waking up."],
    "moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 86% Atk + 9 x (Level - 1) + 190", "Damage: 211% Atk + 23 x (Level - 1) + 420", "Damage: 200% Atk + 15 x (Level - 1) + 400 ; Damage: 262% Atk + 21 x (Level - 1) + 520", "Basic Attack - Above 80% HP:45% Atk + 7 x (Level - 1) + 90 + 5% Max HP ; Boosted Attack - Above 80% HP:67.5% Atk + 10 x (Level - 1) + 135 + 6% Max HP ; Basic Attack - Above 80% HP: 81% Atk + 7 x (Level - 1) + 100 + 5% Max HP ; Boosted Attack - Above 80% HP:121.5% Atk + 10 x (Level - 1) + 150 + 6% Max HP", "Null", "Shield: 10% max HP + 900", "Null", "Damage: 132% Atk + 8 x (Level - 1) + 360 ; Damage - DoT (3 Ticks): 66% Atk + 4 x (Level - 1) + 180","Null", "Null", "Null", "Null"],
    "moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Gluttony.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Tackle.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Heavy%20Slam.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Flail.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Rest.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Block.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Yawn.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Snorlax/Power%20Nap.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Snorlax.png"],
    "class":["Defender", "3","10","4","3","5"]
    },

{"name": "Sylveon",
"move":["Adaptability", "Basic Attack", "Swift", "Mystical Fire", "Hyper Voice", "Baby Doll Eyes", "Draining Kiss", "Calm Mind", "Fairy Frolic"],
"movecd":["Null", "Null", "7", "7", "5", "5", "10", "10", "139"],
"movedesc":["Every time Eevee deals or receives damage, increase Sp. Attack by 5% for 1.5s, stacking up to 4 times. Every time Sylveon deals or receives damage, increase Sp. Atk and Sp. Defense by 2.5% for 1.5s, stacking up to 6 times.","Becomes a boosted attack with every third attack, dealing increased damage. In addition - after evolving into Sylveon - increase movement speed when this boosted attack hits.","Shoots star-shaped rays at enemies, dealing damage to them.","Create four small flames while leaping in the designated direction. The flames shoot toward enemies one by one, dealing damage and decreasing their Sp. Attack by 15% for 1s, stacking up to 4 times. Each time a flame hits, reduce the cooldown of this move and after the first flame hits, subsequent flames on the same target deal 25% damage.","Unleashes an attack of multiple sound waves that deal damage when they hit. The damage dealt increases the farther the target is from Sylveon. Every sound wave reduces enemy Sp. Defense by 20% (stacking up to 4 times at 80%) after dealing damage to an enemy.","Stare at an enemy with baby-doll eyes, dealing damage and decreasing their Attack and movement speed for a short time when this move hits.","Blow a kiss at an enemy that goes back and forth between Sylveon and the target multiple times. When the kiss touches Sylveon, restore HP. When it hits the enemy, deal damage and decrease their movement speed for a short time. If Sylveon and the enemy move too far away from each other, the kiss will disappear faster than normal","Sylveon quietly focuses their mind and calms their spirit, increasing movement speed, Sp. Attack by 40% and Sp. Defense by 10% for a short time.","Jump into the air and become briefly invincible. The moment Sylveon lands, deal damage to enemies in the area of effect and restore Sylveon's HP. For 10s afterward, 50% of damage dealt by Sylveon is converted into HP (basic attacks are excluded).","Increases the number of flames by one.","Increases the number of sound waves by one.","Increases the amount of HP this move restores.","Up to 3s after using this move, if Sylveon is hit by an Enemy's move, the damage is completely nullified and Sylveon is granted a shield."],
"moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 35% SpA + 10 x (Level - 1) + 180", "Damage - per Star (4 stars): 32% SpA + 6 x (Level - 1) + 190", "Damage - First Hit: 70% SpA + 11 x (Level - 1) + 420", "Damage - Near (6x): 32% SpA + 5 x (Level - 1) + 110 ; Damage - Far (6x): 54% SpA + 8 x (Level - 1) + 184", "Damage: 63% SpA + 18 x (Level - 1) + 340", "Damge (3x): 26% SpA + 4 x (Level - 1) + 160 ; Healing (3x): 15% SpA + 0 x (Level - 1) + 120 ; Healing (3x): 22.5% SpA + 0 x (Level - 1) + 180", "Shield: 90% SpA + 0 x (Level - 1) + 100", "Damage: 104% SpA + 13 x (Level - 1) + 620","Null", "Null", "Null", "Null"],
"moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Adaptability.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Swift.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Mystical%20Fire.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Hyper%20Voice.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Baby%20Doll%20Eyes.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Draining%20Kiss.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Calm%20Mind.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Sylveon/Fairy%20Frolic.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Sylveon.png"],
"class":["Attacker", "7","3","3","7","7"]
},
{"name": "Talonflame",
"move":["Gale Wings", "Basic Attack", "Peck", "Flame Charge", "Aerial Ace", "Acrobatics", "Fly", "Brave Bird", "Flame Sweep"],
"movecd":["Null", "Null", "5", "6.5", "6", "8", "9", "10", "89"],
"movedesc":["While above 85% HP, movement speed is increased by 10%.","Becomes a boosted attack every third attack, creating a fiery whirlwind that deals damage to enemies in the area of effect. This boosted attack remains readied even after leaving combat.","Talonflame flies toward a target Pokémon and attacks it three times.","Talonflame dashes forward, damaging enemies in its path. Talonflame gains a speed boost after the dash.","Talonflame dashes through a targeted enemy, damaging it. Talonflame's next basic attack is boosted.","Talonflame flies toward a targeted area, attacking all Pokémon in the area up to three times. Talonflame can choose a direction to dash after the move ends.","Talonflame flies up into the sky, becoming untargetable. After 3 seconds, Talonflame dives at the targeted area, damaging all enemies in the area. Fly can be recast to dive early.","Talonflame dives at the targeted area, taking 5% of remaining HP as recoil damage and damaging all enemies in the area. If Talonflame uses a boosted basic attack on an enemy hit by Brave Bird within 4 seconds, the cooldown of Flame Charge or Aerial Ace is reset. The cooldown of Flame Charge and Aerial Ace can only be reset once per target hit by Brave bird.","Talonflame charges forward, damaging and shoving all enemies in its path. Flame Sweep deals damage up to 2 times.","For a short time after this move hits, Talonflame's abilities and basic attacks partially ignore the enemies defense for the next 3s (capped at 0) and enemies hit are slowed by 30% for 5 seconds.","Increased damage.","Enemies hit are also knocked up.","Talonflame takes 15% less damage for 5 seconds when this move hits."],
"moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 125% Atk + 0 x (Level - 1) + 0", "Damage (3x): 38% Atk + 2 x (Level - 1) + 70", "Damage: 106% Atk + 14 x (Level - 1) + 340 ; Defense Reduction: 0% Atk + 3 x (Level - 1) + 60", "Damage: 95% Atk + 14 x (Level - 1) + 350 ; Damage: 103% Atk + 16 x (Level - 1) + 370", "Damage (3x): 75% Atk + 6 x (Level - 1) + 200", "Damage: 255% Atk + 24 x (Level - 1) + 1050", "Damage: 230% Atk + 21 x (Level - 1) + 940","Null", "Null", "Null", "Null"],
"moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Gale%20Wings.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Peck.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Flame%20Charge.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Aerial%20Ace.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Acrobatics.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Fly.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Brave%20Bird.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Talonflame/Flame%20Sweep.png", "https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Talonflame.png"],
"class":["Speedster", "5","3","10","7","1"]
},
{"name": "Venusaur",
"move":["Overgrow", "Basic Attack", "Seed Bomb", "Sludge Bomb", "Giga Drain", "Razor Leaf", "Solar Beam", "Petal Dance", "Verdant Anger"],
"movecd":["Null", "Null", "6", "6", "7", "9", "10", "9", "134"],
"movedesc":["When HP is 30% or less, increase all damage dealt by 20%.","Becomes a boosted attack with every third attack, dealing increased damage. This boosted attack also pulls enemies inward between the vines.","Venusaur hurls a large seed to the designated location, damaging all enemies in the radius.","Venusaur hurls toxic sludge to the designated location, damaging and poisoning all enemies in the radius when it lands. The sludge lingers, damaging enemies over time in the radius, slowing them, and reducing their Sp. Def for a short time.","Venusaur emits a cone-shaped blast in the designated direction, damaging enemies and restoring health when it hits. Venusaur also takes 35% reduced damage for a short time.","Venusaur launches a barrage of sharp-edged leaves in the designated direction, damaging enemies over time.","Venusaur fires a beam of light in the designated direction, damaging enemies over time. It is divided into four distinct hits, with ten damaging ticks randomly divided among these four hits.","Venusaur scatters petals around themself for 5s, increasing movement speed and damaging enemies over time in the radius. Petal dance reduces the cooldown of Sludge Bomb or Giga Drain by 30% of the current remaining cooldown, per tick of damage that hit an enemy PokÃ©mon (not wilds, and hitting multiples enemies reduces the cooldown more).","Venusaur hurls a massive seed to the designated location, damaging all enemies in the radius. The seed then splits apart into 4 smaller seeds, each damaging all enemies in their radius."],
"moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted (2x): 54% SpA + 10 x (Level - 1) + 180", "Damage: 55% SpA + 10 x (Level - 1) + 190 ", "Damage: 37% SpA + 11 x (Level - 1) + 250 ; Damage - Area (10 Ticks): 4% SpA + 1 x (Level - 1) + 25", "Damage: 55% SpA + 16 x (Level - 1) + 400 ; Healing: 27% SpA + 7 x (Level - 1) + 180", "Damage (10x): 17% SpA + 2 x (Level - 1) + 70", "Damage (5 Ticks): 27% SpA + 5 x (Level - 1) + 230 : Damage (5 Ticks):1.5% Enemy Max HP", "Damage - Aura (16 Ticks): 8% SpA + 2 x (Level - 1) + 70", "Damage - Initial: 131% SpA + 23 x (Level - 1) + 1080 ; Damage - Secondary: 65.5% SpA + 12 x (Level - 1) + 540","Null", "Null", "Null", "Null"],
"moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Overgrow.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Seed%20Bomb.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Sludge%20Bomb.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Giga%20Drain.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Razor%20Leaf.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Solar%20Beam.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Petal%20Dance.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Venusaur/Verdant%20Anger.png"],
"class":["Attacker", "9","4","4","5","2"]
},
{
"name": "Wigglytuff",
"move":["Cute Charm", "Basic Attack", "Pound", "Double Slap", "Dazzling Gleam", "Defense Curl", "Rollout", "Sing", "Starlight Recital"],
"movecd":["10", "Null", "5", "5", "4.5", "8", "10", "10", "134"],
"movedesc":["When hit by an enemy attack at close range, make that enemy infatuated for a short time. Infatuated enemies become enthralled and approach Wigglytuff against their will. The effects of this ability have a cooldown and cannot trigger on the same enemy in quick succession.","Becomes a boosted attack with every third attack, dealing damage to enemies and spinning them around when it hits.","Wigglytuff slaps the area in front of them twice, damaging and slowing enemies in a cone.","Wigglytuff unleashes a barrage of slaps, damaging and slowing enemies in a cone 3-5 times.","Wigglytuff emits a flash of fairy energy, dealing a small amount of damage in a cone followed by a large amount of damage.","Wigglytuff gains a shield and rolls forward a short distance, throwing enemies hit. Hitting an obstacle while rolling will change the direction Wigglytuff is moving and reset the cooldown of Pound, Double Slap, or Dazzling Gleam.","Wigglytuff gains a shield and rolls forward, damaging and throwing enemies hit. Hitting an obstacle while rolling will change the direction Wigglytuff is moving up to 5 times and reset the cooldown of Pound, Double Slap, or Dazzling Gleam.","Wigglytuff begins singing, slowing enemies around them. Enemies that stay inside the song's effect for too long will be put to sleep, and have their defense and special defense reduced for a short time.","Begin performing a recital, granting Wigglytuff and nearby allies a shield as well as removing all status conditions from the affected allies and granting them immunity to hindrances for a short time.","Slaps 4-6 times instead.","Slows enemies hit by the first flash.","Increases the amount of time enemies are thrown.","Increases the amount of time enemies are asleep."],
"moversb":["Null", "Damage - Auto: 100% Atk as SpA ; Damage - Boosted: 44% SpA + 18 x (Level - 1) + 340", "Damage - per Slap: 31% SpA + 18 x (Level - 1) + 340", "Damage - per Slap: 18% SpA + 9 x (Level - 1) + 200", "Damage - First Hit: 13% SpA + 6 x (Level - 1) + 144 ; Damage - Second Hit: 65% SpA + 33 x (Level - 1) + 720", "Damage - per Hit: 47% SpA + 14 x (Level - 1) + 590", "Null", "Shield: 150% SpA + 0 x (Level - 1) + 800", "Null", "Null", "Null", "Null"],
"moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Cute%20Charm.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Pound.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Double%20Slap.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Dazzling%20Gleam.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Defense%20Curl.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Rollout.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Sing.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Wigglytuff/Starlight%20Recital.png"],
"class":["Support", "2","5","5","4","9"]
},
{
"name": "Zeraora",
"move":["Volt Absorb", "Basic Attack", "Agility", "Volt Switch", "Spark", "Slash", "Discharge", "Wild Charge", "Plasma Gale"],
"movecd":["Null", "Null", "6", "8", "10", "8.5", "12", "9", "112"],
"movedesc":["Converts 8% of the damage Zeraora was dealt in the last 4 seconds as Atk, up to 200 Atk.", "Becomes a boosted attack with every third attack, dealing increased damage and paralyzing the enemy while restoring 10% of Zeraora's missing HP.", "Zeraora quickly dashes forward, increasing basic attack speed for a short duration.", "Zeraora charges forward, damaging enemies in their path and increasing their basic attack speed for a short time. Activating this ability again before it expires will teleport Zeraora to their original location.", "Zeraora leaps in a selected direction, damaging enemies in their path. If a basic attack is used before the leap ends, Zeraora will jump to the closest enemy, dealing damage. Holds 3 uses in reserve.", "Zeraora charges toward an enemy and attacks them with multiple swipes, ending with an interrupt that knocks the enemy into the air.", "Zeraora emits an electric aura, damaging all enemies within the aura and granting a shield to Zeraora when it hits. Any paralyzed enemies within the area of effect are pulled towards Zeraora when the move ends, damaging and stunning them.", "Zeraora charges towards an enemy, damaging them and switching to the nearest enemy if the initial target's HP drops to zero. Hitting enemies with abilities or boosted attacks previously within a set time provides up to 3 stacks, each stack adding an additional hit to Wild Charge. The first hit deals full damage and subsequent hits deal half damage. Zeraora takes 1% remaining HP (per hit) as physical damage upon use. The first hit deals 2 instances of recoil damage and subsequent hits deal only 1.", "Launches a bolt of lightning that travels towards the enemy, dealing damage in an area of effect and knocking all enemies hit into the air. Creates a temporary area of electricity centered on the initial target that increases Zeraora's basic attack damage by 20% while inside the area.", "Increased damage and longer duration of increased basic attack speed.", "HP is restored if the user performs a basic attack before reaching the enemy.", "Enemies hit are slowed.", "Deals damage to nearby enemies when it hits."],
"moversb":["Null", "Damage - Basic: 100% Atk ; Damage - Boosted: 110% Atk + 0 x (Level - 1) + 0","Null","Damage: 58% Atk + 4 x (Level - 1) + 190 ; Damage: 71% Atk + 5 x (Level - 1) + 220 ","Damage - Jump: 56% Atk + 3 x (Level - 1) + 110 ; Damage - Attack: If a basic attack is used before the leap ends, deal 170% Atk as damage instead. 170% Atk + 0 x (Level - 1) + 0","Damage - per Hit (3 Hits): 70% Atk + 5 x (Level - 1) + 190","Damage - per Tick (6 Ticks): 43% Atk + 3 x (Level - 1) + 130 ; Damage - Aura (Final Tick): Deals double damage","Damage: 149% Atk + 11 x (Level - 1) + 500 ; Damage - Subsequent Hits: Deals half damage.","Damage: 248% Atk + 14 x (Level - 1) + 680", "Damage: 71% Atk + 5 x (Level - 1) + 220", "Null", "Null", "Null"],
"moveicon":["https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Volt%20Absorb.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Attack.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Agility.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Volt%20Switch.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Spark.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Slash.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Discharge.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Wild%20Charge.png", "https://d275t8dp8rxb42.cloudfront.net/skills/Zeraora/Plasma%20Gale.png","https://d275t8dp8rxb42.cloudfront.net/pokemon/portrait/Zeraora.png"],
"class":["Speedster", "7","3","8","6","1"]}

]